; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Description
;;; ------------
;;; A manipulator works in an environment in
;;; which...
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain MANIPULATOR)
  (:requirements :strips :typing)
  (:types block				;This is the object that is supposed to be manipulated
	  door				;This can be opened or closed
	  location			;Location at which obstruction is safe
  )

  (:predicates (m-at ?l - location)
	       (b-at ?b - block ?l - location)
	       (d-at ?d - door ?l1 ?l2 - location)
	       (adjacent ?l1 ?l2 - location)
 	       (holding ?b - block)
	       (on ?b1 ?b2 - block)
	       (onground ?b - block)
	       (clear ?b - block)
	       (empty ?l - location)
	       (free-grippers)
  )

  (:action move
	     :parameters (?from ?to - location)
	     :precondition 
		(and (m-at ?from)
		(adjacent ?from ?to))
	     :effect
		(and (m-at ?to)
		(not(m-at ?from)))
  )


  (:action place
	     :parameters (?b - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(empty ?l)
		(holding ?b))
	     :effect
	        (and (free-grippers)
		(not(holding ?b))
		(b-at ?b ?l)
		(clear ?b)
		(not(empty ?l))
		(onground ?b))
  )


  (:action stack
	     :parameters (?btop ?bbottom - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?bbottom ?l)
		(clear ?bbottom)
		(holding ?btop))
	     :effect
	        (and (free-grippers)
		(not(holding ?btop))
		(b-at ?btop ?l)
		(on ?btop ?bbottom)
		(not(clear ?bbottom))
		(clear ?btop))
  )


  (:action pickup
	     :parameters (?b - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?b ?l)
		(onground ?b)
		(clear ?b)
		(free-grippers))
	     :effect
		(and (holding ?b)
		(not(b-at ?b ?l))
		(not(free-grippers))
		(not(onground ?b))
		(empty ?l)
		(not(clear ?b)))
  )

  (:action destack
	     :parameters (?btop ?bbottom - block ?l - location)
	     :precondition 
		(and (m-at ?l)
		(b-at ?btop ?l)
		(b-at ?bbottom ?l)
		(clear ?btop)
		(on ?btop ?bbottom)
		(free-grippers))
	     :effect
		(and (holding ?btop)
		(not(b-at ?btop ?l))
		(not(free-grippers))
		(not(on ?btop ?bbottom))
		(not(clear ?btop))
		(clear ?bbottom))
  )


  (:action open
	     :parameters (?d - door ?unlockable ?locked - location)
	     :precondition 
		(and (m-at ?unlockable)
		(d-at ?d ?unlockable ?locked)
		(free-grippers))
	     :effect
		(and (adjacent ?unlockable ?locked)
		(adjacent ?locked ?unlockable))
  )

)

; problem
(define (problem MANIPULATOR-1)

(:domain MANIPULATOR)
  (:objects
	L1 L2 L3 - location
	B1 B2 B3 - block
  )

  (:init
	(m-at L3)
	(free-grippers)
	(adjacent L1 L2)(adjacent L2 L1)
	(adjacent L2 L3)(adjacent L3 L2)
	(b-at B1 L1)(b-at B2 L1)(b-at B3 L1)
	(onground B1)(on B2 B1)(on B3 B2)(clear B3)
	(empty L2)
	(empty L3)
  )

  (:goal 
	(and(b-at B1 L3)
	(on B2 B1)
	(on B3 B2))
  )
)

; plan
1. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 2 of 3
2. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 2 of 3
3. (destack b3 b2 l1)
   deleted: (b-at b3 l1) (free-grippers) (on b3 b2) (clear b3)
   added: (holding b3) (clear b2)
   goals met: 1 of 3
4. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 1 of 3
5. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 1 of 3
6. (place b3 l3)
   deleted: (holding b3) (empty l3)
   added: (free-grippers) (b-at b3 l3) (clear b3) (onground b3)
   goals met: 1 of 3
7. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 1 of 3
8. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 1 of 3
9. (destack b2 b1 l1)
   deleted: (b-at b2 l1) (free-grippers) (on b2 b1) (clear b2)
   added: (holding b2) (clear b1)
   goals met: 0 of 3
10. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 0 of 3
11. (place b2 l2)
   deleted: (holding b2) (empty l2)
   added: (free-grippers) (b-at b2 l2) (clear b2) (onground b2)
   goals met: 0 of 3
12. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 0 of 3
13. (pickup b3 l3)
   deleted: (b-at b3 l3) (free-grippers) (onground b3) (clear b3)
   added: (holding b3) (empty l3)
   goals met: 0 of 3
14. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 0 of 3
15. (stack b3 b2 l2)
   deleted: (holding b3) (clear b2)
   added: (free-grippers) (b-at b3 l2) (on b3 b2) (clear b3)
   goals met: 1 of 3
16. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 1 of 3
17. (pickup b1 l1)
   deleted: (b-at b1 l1) (free-grippers) (onground b1) (clear b1)
   added: (holding b1) (empty l1)
   goals met: 1 of 3
18. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 1 of 3
19. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 1 of 3
20. (place b1 l3)
   deleted: (holding b1) (empty l3)
   added: (free-grippers) (b-at b1 l3) (clear b1) (onground b1)
   goals met: 2 of 3
21. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 2 of 3
22. (destack b3 b2 l2)
   deleted: (b-at b3 l2) (free-grippers) (on b3 b2) (clear b3)
   added: (holding b3) (clear b2)
   goals met: 1 of 3
23. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 1 of 3
24. (place b3 l1)
   deleted: (holding b3) (empty l1)
   added: (free-grippers) (b-at b3 l1) (clear b3) (onground b3)
   goals met: 1 of 3
25. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 1 of 3
26. (pickup b2 l2)
   deleted: (b-at b2 l2) (free-grippers) (onground b2) (clear b2)
   added: (holding b2) (empty l2)
   goals met: 1 of 3
27. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 1 of 3
28. (stack b2 b1 l3)
   deleted: (holding b2) (clear b1)
   added: (free-grippers) (b-at b2 l3) (on b2 b1) (clear b2)
   goals met: 2 of 3
29. (move l3 l2)
   deleted: (m-at l3)
   added: (m-at l2)
   goals met: 2 of 3
30. (move l2 l1)
   deleted: (m-at l2)
   added: (m-at l1)
   goals met: 2 of 3
31. (pickup b3 l1)
   deleted: (b-at b3 l1) (free-grippers) (onground b3) (clear b3)
   added: (holding b3) (empty l1)
   goals met: 2 of 3
32. (move l1 l2)
   deleted: (m-at l1)
   added: (m-at l2)
   goals met: 2 of 3
33. (move l2 l3)
   deleted: (m-at l2)
   added: (m-at l3)
   goals met: 2 of 3
34. (stack b3 b2 l3)
   deleted: (holding b3) (clear b2)
   added: (free-grippers) (b-at b3 l3) (on b3 b2) (clear b3)
   goals met: 3 of 3
